<template>
  {{ questionsNumList }}
</template>

<script>
import { mapState } from 'vuex'
export default {

  computed: {
    ...mapState(['questionsNumList'])
  },

  data () {
    return {
      questionsList: {
        是非題: [
          {
            題目: '是非題 0',
            答案: 'D'
          },
          {
            題目: '是非題 1',
            答案: 'C'
          },
          {
            題目: '是非題 2',
            答案: 'A'
          },
          {
            題目: '是非題 3',
            答案: 'B'
          },
          {
            題目: '是非題 4',
            答案: 'B'
          },
          {
            題目: '是非題 5',
            答案: 'D'
          },
          {
            題目: '是非題 6',
            答案: 'B'
          },
          {
            題目: '是非題 7',
            答案: 'C'
          },
          {
            題目: '是非題 8',
            答案: 'C'
          },
          {
            題目: '是非題 9',
            答案: 'D'
          },
          {
            題目: '是非題 10',
            答案: 'A'
          },
          {
            題目: '是非題 11',
            答案: 'D'
          },
          {
            題目: '是非題 12',
            答案: 'B'
          },
          {
            題目: '是非題 13',
            答案: 'C'
          },
          {
            題目: '是非題 14',
            答案: 'C'
          },
          {
            題目: '是非題 15',
            答案: 'D'
          },
          {
            題目: '是非題 16',
            答案: 'D'
          },
          {
            題目: '是非題 17',
            答案: 'B'
          },
          {
            題目: '是非題 18',
            答案: 'B'
          },
          {
            題目: '是非題 19',
            答案: 'D'
          },
          {
            題目: '是非題 20',
            答案: 'C'
          },
          {
            題目: '是非題 21',
            答案: 'A'
          },
          {
            題目: '是非題 22',
            答案: 'A'
          },
          {
            題目: '是非題 23',
            答案: 'C'
          },
          {
            題目: '是非題 24',
            答案: 'A'
          },
          {
            題目: '是非題 25',
            答案: 'B'
          },
          {
            題目: '是非題 26',
            答案: 'C'
          },
          {
            題目: '是非題 27',
            答案: 'C'
          },
          {
            題目: '是非題 28',
            答案: 'C'
          },
          {
            題目: '是非題 29',
            答案: 'D'
          },
          {
            題目: '是非題 30',
            答案: 'A'
          },
          {
            題目: '是非題 31',
            答案: 'B'
          },
          {
            題目: '是非題 32',
            答案: 'B'
          },
          {
            題目: '是非題 33',
            答案: 'D'
          },
          {
            題目: '是非題 34',
            答案: 'B'
          },
          {
            題目: '是非題 35',
            答案: 'C'
          },
          {
            題目: '是非題 36',
            答案: 'C'
          },
          {
            題目: '是非題 37',
            答案: 'A'
          },
          {
            題目: '是非題 38',
            答案: 'A'
          },
          {
            題目: '是非題 39',
            答案: 'B'
          },
          {
            題目: '是非題 40',
            答案: 'A'
          },
          {
            題目: '是非題 41',
            答案: 'C'
          },
          {
            題目: '是非題 42',
            答案: 'A'
          },
          {
            題目: '是非題 43',
            答案: 'A'
          },
          {
            題目: '是非題 44',
            答案: 'C'
          },
          {
            題目: '是非題 45',
            答案: 'A'
          },
          {
            題目: '是非題 46',
            答案: 'C'
          },
          {
            題目: '是非題 47',
            答案: 'A'
          },
          {
            題目: '是非題 48',
            答案: 'B'
          },
          {
            題目: '是非題 49',
            答案: 'B'
          },
          {
            題目: '是非題 50',
            答案: 'B'
          },
          {
            題目: '是非題 51',
            答案: 'C'
          },
          {
            題目: '是非題 52',
            答案: 'B'
          },
          {
            題目: '是非題 53',
            答案: 'D'
          },
          {
            題目: '是非題 54',
            答案: 'A'
          },
          {
            題目: '是非題 55',
            答案: 'B'
          },
          {
            題目: '是非題 56',
            答案: 'D'
          },
          {
            題目: '是非題 57',
            答案: 'D'
          },
          {
            題目: '是非題 58',
            答案: 'A'
          },
          {
            題目: '是非題 59',
            答案: 'A'
          },
          {
            題目: '是非題 60',
            答案: 'C'
          },
          {
            題目: '是非題 61',
            答案: 'D'
          },
          {
            題目: '是非題 62',
            答案: 'B'
          },
          {
            題目: '是非題 63',
            答案: 'D'
          },
          {
            題目: '是非題 64',
            答案: 'A'
          },
          {
            題目: '是非題 65',
            答案: 'C'
          },
          {
            題目: '是非題 66',
            答案: 'D'
          },
          {
            題目: '是非題 67',
            答案: 'B'
          },
          {
            題目: '是非題 68',
            答案: 'D'
          },
          {
            題目: '是非題 69',
            答案: 'B'
          },
          {
            題目: '是非題 70',
            答案: 'A'
          },
          {
            題目: '是非題 71',
            答案: 'D'
          },
          {
            題目: '是非題 72',
            答案: 'B'
          },
          {
            題目: '是非題 73',
            答案: 'C'
          },
          {
            題目: '是非題 74',
            答案: 'B'
          },
          {
            題目: '是非題 75',
            答案: 'B'
          },
          {
            題目: '是非題 76',
            答案: 'C'
          },
          {
            題目: '是非題 77',
            答案: 'B'
          },
          {
            題目: '是非題 78',
            答案: 'B'
          },
          {
            題目: '是非題 79',
            答案: 'C'
          },
          {
            題目: '是非題 80',
            答案: 'B'
          },
          {
            題目: '是非題 81',
            答案: 'D'
          },
          {
            題目: '是非題 82',
            答案: 'D'
          },
          {
            題目: '是非題 83',
            答案: 'B'
          },
          {
            題目: '是非題 84',
            答案: 'A'
          },
          {
            題目: '是非題 85',
            答案: 'D'
          },
          {
            題目: '是非題 86',
            答案: 'D'
          },
          {
            題目: '是非題 87',
            答案: 'D'
          },
          {
            題目: '是非題 88',
            答案: 'C'
          },
          {
            題目: '是非題 89',
            答案: 'B'
          },
          {
            題目: '是非題 90',
            答案: 'B'
          },
          {
            題目: '是非題 91',
            答案: 'B'
          },
          {
            題目: '是非題 92',
            答案: 'D'
          },
          {
            題目: '是非題 93',
            答案: 'A'
          },
          {
            題目: '是非題 94',
            答案: 'C'
          },
          {
            題目: '是非題 95',
            答案: 'D'
          },
          {
            題目: '是非題 96',
            答案: 'B'
          },
          {
            題目: '是非題 97',
            答案: 'D'
          },
          {
            題目: '是非題 98',
            答案: 'D'
          },
          {
            題目: '是非題 99',
            答案: 'B'
          },
          {
            題目: '是非題 100',
            答案: 'A'
          }
        ],
        單選題: [
          {
            題目: '單選題 0',
            答案: 'C'
          },
          {
            題目: '單選題 1',
            答案: 'A'
          },
          {
            題目: '單選題 2',
            答案: 'D'
          },
          {
            題目: '單選題 3',
            答案: 'B'
          },
          {
            題目: '單選題 4',
            答案: 'B'
          },
          {
            題目: '單選題 5',
            答案: 'C'
          },
          {
            題目: '單選題 6',
            答案: 'C'
          },
          {
            題目: '單選題 7',
            答案: 'B'
          },
          {
            題目: '單選題 8',
            答案: 'B'
          },
          {
            題目: '單選題 9',
            答案: 'C'
          },
          {
            題目: '單選題 10',
            答案: 'D'
          },
          {
            題目: '單選題 11',
            答案: 'A'
          },
          {
            題目: '單選題 12',
            答案: 'C'
          },
          {
            題目: '單選題 13',
            答案: 'C'
          },
          {
            題目: '單選題 14',
            答案: 'A'
          },
          {
            題目: '單選題 15',
            答案: 'A'
          },
          {
            題目: '單選題 16',
            答案: 'D'
          },
          {
            題目: '單選題 17',
            答案: 'D'
          },
          {
            題目: '單選題 18',
            答案: 'B'
          },
          {
            題目: '單選題 19',
            答案: 'B'
          },
          {
            題目: '單選題 20',
            答案: 'B'
          },
          {
            題目: '單選題 21',
            答案: 'A'
          },
          {
            題目: '單選題 22',
            答案: 'A'
          },
          {
            題目: '單選題 23',
            答案: 'C'
          },
          {
            題目: '單選題 24',
            答案: 'C'
          },
          {
            題目: '單選題 25',
            答案: 'B'
          },
          {
            題目: '單選題 26',
            答案: 'D'
          },
          {
            題目: '單選題 27',
            答案: 'C'
          },
          {
            題目: '單選題 28',
            答案: 'A'
          },
          {
            題目: '單選題 29',
            答案: 'C'
          },
          {
            題目: '單選題 30',
            答案: 'C'
          },
          {
            題目: '單選題 31',
            答案: 'D'
          },
          {
            題目: '單選題 32',
            答案: 'C'
          },
          {
            題目: '單選題 33',
            答案: 'D'
          },
          {
            題目: '單選題 34',
            答案: 'B'
          },
          {
            題目: '單選題 35',
            答案: 'D'
          },
          {
            題目: '單選題 36',
            答案: 'B'
          },
          {
            題目: '單選題 37',
            答案: 'C'
          },
          {
            題目: '單選題 38',
            答案: 'D'
          },
          {
            題目: '單選題 39',
            答案: 'A'
          },
          {
            題目: '單選題 40',
            答案: 'C'
          },
          {
            題目: '單選題 41',
            答案: 'A'
          },
          {
            題目: '單選題 42',
            答案: 'D'
          },
          {
            題目: '單選題 43',
            答案: 'B'
          },
          {
            題目: '單選題 44',
            答案: 'B'
          },
          {
            題目: '單選題 45',
            答案: 'C'
          },
          {
            題目: '單選題 46',
            答案: 'B'
          },
          {
            題目: '單選題 47',
            答案: 'B'
          },
          {
            題目: '單選題 48',
            答案: 'B'
          },
          {
            題目: '單選題 49',
            答案: 'D'
          },
          {
            題目: '單選題 50',
            答案: 'A'
          },
          {
            題目: '單選題 51',
            答案: 'A'
          },
          {
            題目: '單選題 52',
            答案: 'D'
          },
          {
            題目: '單選題 53',
            答案: 'A'
          },
          {
            題目: '單選題 54',
            答案: 'C'
          },
          {
            題目: '單選題 55',
            答案: 'D'
          },
          {
            題目: '單選題 56',
            答案: 'C'
          },
          {
            題目: '單選題 57',
            答案: 'C'
          },
          {
            題目: '單選題 58',
            答案: 'C'
          },
          {
            題目: '單選題 59',
            答案: 'C'
          },
          {
            題目: '單選題 60',
            答案: 'A'
          },
          {
            題目: '單選題 61',
            答案: 'D'
          },
          {
            題目: '單選題 62',
            答案: 'C'
          },
          {
            題目: '單選題 63',
            答案: 'C'
          },
          {
            題目: '單選題 64',
            答案: 'C'
          },
          {
            題目: '單選題 65',
            答案: 'A'
          },
          {
            題目: '單選題 66',
            答案: 'B'
          },
          {
            題目: '單選題 67',
            答案: 'C'
          },
          {
            題目: '單選題 68',
            答案: 'C'
          },
          {
            題目: '單選題 69',
            答案: 'A'
          },
          {
            題目: '單選題 70',
            答案: 'A'
          },
          {
            題目: '單選題 71',
            答案: 'B'
          },
          {
            題目: '單選題 72',
            答案: 'C'
          },
          {
            題目: '單選題 73',
            答案: 'B'
          },
          {
            題目: '單選題 74',
            答案: 'C'
          },
          {
            題目: '單選題 75',
            答案: 'B'
          },
          {
            題目: '單選題 76',
            答案: 'A'
          },
          {
            題目: '單選題 77',
            答案: 'D'
          },
          {
            題目: '單選題 78',
            答案: 'B'
          },
          {
            題目: '單選題 79',
            答案: 'D'
          },
          {
            題目: '單選題 80',
            答案: 'C'
          },
          {
            題目: '單選題 81',
            答案: 'D'
          },
          {
            題目: '單選題 82',
            答案: 'A'
          },
          {
            題目: '單選題 83',
            答案: 'A'
          },
          {
            題目: '單選題 84',
            答案: 'C'
          },
          {
            題目: '單選題 85',
            答案: 'D'
          },
          {
            題目: '單選題 86',
            答案: 'C'
          },
          {
            題目: '單選題 87',
            答案: 'B'
          },
          {
            題目: '單選題 88',
            答案: 'A'
          },
          {
            題目: '單選題 89',
            答案: 'D'
          },
          {
            題目: '單選題 90',
            答案: 'D'
          },
          {
            題目: '單選題 91',
            答案: 'A'
          },
          {
            題目: '單選題 92',
            答案: 'C'
          },
          {
            題目: '單選題 93',
            答案: 'D'
          },
          {
            題目: '單選題 94',
            答案: 'B'
          },
          {
            題目: '單選題 95',
            答案: 'C'
          },
          {
            題目: '單選題 96',
            答案: 'B'
          },
          {
            題目: '單選題 97',
            答案: 'D'
          },
          {
            題目: '單選題 98',
            答案: 'C'
          },
          {
            題目: '單選題 99',
            答案: 'A'
          },
          {
            題目: '單選題 100',
            答案: 'A'
          }
        ],
        複選題: [
          {
            題目: '複選題 0',
            答案: 'D'
          },
          {
            題目: '複選題 1',
            答案: 'D'
          },
          {
            題目: '複選題 2',
            答案: 'D'
          },
          {
            題目: '複選題 3',
            答案: 'B'
          },
          {
            題目: '複選題 4',
            答案: 'B'
          },
          {
            題目: '複選題 5',
            答案: 'C'
          },
          {
            題目: '複選題 6',
            答案: 'C'
          },
          {
            題目: '複選題 7',
            答案: 'B'
          },
          {
            題目: '複選題 8',
            答案: 'A'
          },
          {
            題目: '複選題 9',
            答案: 'A'
          },
          {
            題目: '複選題 10',
            答案: 'D'
          },
          {
            題目: '複選題 11',
            答案: 'B'
          },
          {
            題目: '複選題 12',
            答案: 'A'
          },
          {
            題目: '複選題 13',
            答案: 'B'
          },
          {
            題目: '複選題 14',
            答案: 'B'
          },
          {
            題目: '複選題 15',
            答案: 'D'
          },
          {
            題目: '複選題 16',
            答案: 'C'
          },
          {
            題目: '複選題 17',
            答案: 'B'
          },
          {
            題目: '複選題 18',
            答案: 'D'
          },
          {
            題目: '複選題 19',
            答案: 'B'
          },
          {
            題目: '複選題 20',
            答案: 'B'
          },
          {
            題目: '複選題 21',
            答案: 'A'
          },
          {
            題目: '複選題 22',
            答案: 'A'
          },
          {
            題目: '複選題 23',
            答案: 'B'
          },
          {
            題目: '複選題 24',
            答案: 'D'
          },
          {
            題目: '複選題 25',
            答案: 'A'
          },
          {
            題目: '複選題 26',
            答案: 'D'
          },
          {
            題目: '複選題 27',
            答案: 'C'
          },
          {
            題目: '複選題 28',
            答案: 'D'
          },
          {
            題目: '複選題 29',
            答案: 'A'
          },
          {
            題目: '複選題 30',
            答案: 'B'
          },
          {
            題目: '複選題 31',
            答案: 'C'
          },
          {
            題目: '複選題 32',
            答案: 'A'
          },
          {
            題目: '複選題 33',
            答案: 'A'
          },
          {
            題目: '複選題 34',
            答案: 'D'
          },
          {
            題目: '複選題 35',
            答案: 'C'
          },
          {
            題目: '複選題 36',
            答案: 'A'
          },
          {
            題目: '複選題 37',
            答案: 'C'
          },
          {
            題目: '複選題 38',
            答案: 'D'
          },
          {
            題目: '複選題 39',
            答案: 'D'
          },
          {
            題目: '複選題 40',
            答案: 'A'
          },
          {
            題目: '複選題 41',
            答案: 'D'
          },
          {
            題目: '複選題 42',
            答案: 'B'
          },
          {
            題目: '複選題 43',
            答案: 'B'
          },
          {
            題目: '複選題 44',
            答案: 'D'
          },
          {
            題目: '複選題 45',
            答案: 'A'
          },
          {
            題目: '複選題 46',
            答案: 'B'
          },
          {
            題目: '複選題 47',
            答案: 'C'
          },
          {
            題目: '複選題 48',
            答案: 'A'
          },
          {
            題目: '複選題 49',
            答案: 'C'
          },
          {
            題目: '複選題 50',
            答案: 'C'
          },
          {
            題目: '複選題 51',
            答案: 'B'
          },
          {
            題目: '複選題 52',
            答案: 'D'
          },
          {
            題目: '複選題 53',
            答案: 'C'
          },
          {
            題目: '複選題 54',
            答案: 'D'
          },
          {
            題目: '複選題 55',
            答案: 'C'
          },
          {
            題目: '複選題 56',
            答案: 'D'
          },
          {
            題目: '複選題 57',
            答案: 'A'
          },
          {
            題目: '複選題 58',
            答案: 'B'
          },
          {
            題目: '複選題 59',
            答案: 'A'
          },
          {
            題目: '複選題 60',
            答案: 'C'
          },
          {
            題目: '複選題 61',
            答案: 'C'
          },
          {
            題目: '複選題 62',
            答案: 'C'
          },
          {
            題目: '複選題 63',
            答案: 'A'
          },
          {
            題目: '複選題 64',
            答案: 'D'
          },
          {
            題目: '複選題 65',
            答案: 'A'
          },
          {
            題目: '複選題 66',
            答案: 'D'
          },
          {
            題目: '複選題 67',
            答案: 'C'
          },
          {
            題目: '複選題 68',
            答案: 'C'
          },
          {
            題目: '複選題 69',
            答案: 'C'
          },
          {
            題目: '複選題 70',
            答案: 'C'
          },
          {
            題目: '複選題 71',
            答案: 'D'
          },
          {
            題目: '複選題 72',
            答案: 'A'
          },
          {
            題目: '複選題 73',
            答案: 'B'
          },
          {
            題目: '複選題 74',
            答案: 'D'
          },
          {
            題目: '複選題 75',
            答案: 'A'
          },
          {
            題目: '複選題 76',
            答案: 'A'
          },
          {
            題目: '複選題 77',
            答案: 'B'
          },
          {
            題目: '複選題 78',
            答案: 'B'
          },
          {
            題目: '複選題 79',
            答案: 'C'
          },
          {
            題目: '複選題 80',
            答案: 'C'
          },
          {
            題目: '複選題 81',
            答案: 'C'
          },
          {
            題目: '複選題 82',
            答案: 'C'
          },
          {
            題目: '複選題 83',
            答案: 'B'
          },
          {
            題目: '複選題 84',
            答案: 'A'
          },
          {
            題目: '複選題 85',
            答案: 'B'
          },
          {
            題目: '複選題 86',
            答案: 'B'
          },
          {
            題目: '複選題 87',
            答案: 'D'
          },
          {
            題目: '複選題 88',
            答案: 'B'
          },
          {
            題目: '複選題 89',
            答案: 'C'
          },
          {
            題目: '複選題 90',
            答案: 'D'
          },
          {
            題目: '複選題 91',
            答案: 'A'
          },
          {
            題目: '複選題 92',
            答案: 'A'
          },
          {
            題目: '複選題 93',
            答案: 'C'
          },
          {
            題目: '複選題 94',
            答案: 'B'
          },
          {
            題目: '複選題 95',
            答案: 'A'
          },
          {
            題目: '複選題 96',
            答案: 'D'
          },
          {
            題目: '複選題 97',
            答案: 'D'
          },
          {
            題目: '複選題 98',
            答案: 'B'
          },
          {
            題目: '複選題 99',
            答案: 'A'
          },
          {
            題目: '複選題 100',
            答案: 'A'
          }
        ],
        克漏字: [
          {
            題目: '克漏字 0',
            答案: 'D'
          },
          {
            題目: '克漏字 1',
            答案: 'A'
          },
          {
            題目: '克漏字 2',
            答案: 'D'
          },
          {
            題目: '克漏字 3',
            答案: 'B'
          },
          {
            題目: '克漏字 4',
            答案: 'A'
          },
          {
            題目: '克漏字 5',
            答案: 'A'
          },
          {
            題目: '克漏字 6',
            答案: 'A'
          },
          {
            題目: '克漏字 7',
            答案: 'D'
          },
          {
            題目: '克漏字 8',
            答案: 'C'
          },
          {
            題目: '克漏字 9',
            答案: 'B'
          },
          {
            題目: '克漏字 10',
            答案: 'A'
          },
          {
            題目: '克漏字 11',
            答案: 'C'
          },
          {
            題目: '克漏字 12',
            答案: 'D'
          },
          {
            題目: '克漏字 13',
            答案: 'B'
          },
          {
            題目: '克漏字 14',
            答案: 'D'
          },
          {
            題目: '克漏字 15',
            答案: 'D'
          },
          {
            題目: '克漏字 16',
            答案: 'B'
          },
          {
            題目: '克漏字 17',
            答案: 'D'
          },
          {
            題目: '克漏字 18',
            答案: 'B'
          },
          {
            題目: '克漏字 19',
            答案: 'D'
          },
          {
            題目: '克漏字 20',
            答案: 'C'
          },
          {
            題目: '克漏字 21',
            答案: 'D'
          },
          {
            題目: '克漏字 22',
            答案: 'D'
          },
          {
            題目: '克漏字 23',
            答案: 'C'
          },
          {
            題目: '克漏字 24',
            答案: 'C'
          },
          {
            題目: '克漏字 25',
            答案: 'C'
          },
          {
            題目: '克漏字 26',
            答案: 'C'
          },
          {
            題目: '克漏字 27',
            答案: 'D'
          },
          {
            題目: '克漏字 28',
            答案: 'B'
          },
          {
            題目: '克漏字 29',
            答案: 'C'
          },
          {
            題目: '克漏字 30',
            答案: 'C'
          },
          {
            題目: '克漏字 31',
            答案: 'B'
          },
          {
            題目: '克漏字 32',
            答案: 'C'
          },
          {
            題目: '克漏字 33',
            答案: 'B'
          },
          {
            題目: '克漏字 34',
            答案: 'B'
          },
          {
            題目: '克漏字 35',
            答案: 'C'
          },
          {
            題目: '克漏字 36',
            答案: 'D'
          },
          {
            題目: '克漏字 37',
            答案: 'A'
          },
          {
            題目: '克漏字 38',
            答案: 'C'
          },
          {
            題目: '克漏字 39',
            答案: 'A'
          },
          {
            題目: '克漏字 40',
            答案: 'C'
          },
          {
            題目: '克漏字 41',
            答案: 'B'
          },
          {
            題目: '克漏字 42',
            答案: 'D'
          },
          {
            題目: '克漏字 43',
            答案: 'C'
          },
          {
            題目: '克漏字 44',
            答案: 'D'
          },
          {
            題目: '克漏字 45',
            答案: 'B'
          },
          {
            題目: '克漏字 46',
            答案: 'A'
          },
          {
            題目: '克漏字 47',
            答案: 'C'
          },
          {
            題目: '克漏字 48',
            答案: 'A'
          },
          {
            題目: '克漏字 49',
            答案: 'C'
          },
          {
            題目: '克漏字 50',
            答案: 'C'
          },
          {
            題目: '克漏字 51',
            答案: 'A'
          },
          {
            題目: '克漏字 52',
            答案: 'A'
          },
          {
            題目: '克漏字 53',
            答案: 'D'
          },
          {
            題目: '克漏字 54',
            答案: 'B'
          },
          {
            題目: '克漏字 55',
            答案: 'D'
          },
          {
            題目: '克漏字 56',
            答案: 'C'
          },
          {
            題目: '克漏字 57',
            答案: 'C'
          },
          {
            題目: '克漏字 58',
            答案: 'C'
          },
          {
            題目: '克漏字 59',
            答案: 'D'
          },
          {
            題目: '克漏字 60',
            答案: 'C'
          },
          {
            題目: '克漏字 61',
            答案: 'B'
          },
          {
            題目: '克漏字 62',
            答案: 'D'
          },
          {
            題目: '克漏字 63',
            答案: 'C'
          },
          {
            題目: '克漏字 64',
            答案: 'C'
          },
          {
            題目: '克漏字 65',
            答案: 'D'
          },
          {
            題目: '克漏字 66',
            答案: 'B'
          },
          {
            題目: '克漏字 67',
            答案: 'D'
          },
          {
            題目: '克漏字 68',
            答案: 'A'
          },
          {
            題目: '克漏字 69',
            答案: 'B'
          },
          {
            題目: '克漏字 70',
            答案: 'B'
          },
          {
            題目: '克漏字 71',
            答案: 'A'
          },
          {
            題目: '克漏字 72',
            答案: 'B'
          },
          {
            題目: '克漏字 73',
            答案: 'D'
          },
          {
            題目: '克漏字 74',
            答案: 'A'
          },
          {
            題目: '克漏字 75',
            答案: 'A'
          },
          {
            題目: '克漏字 76',
            答案: 'A'
          },
          {
            題目: '克漏字 77',
            答案: 'B'
          },
          {
            題目: '克漏字 78',
            答案: 'A'
          },
          {
            題目: '克漏字 79',
            答案: 'D'
          },
          {
            題目: '克漏字 80',
            答案: 'D'
          },
          {
            題目: '克漏字 81',
            答案: 'D'
          },
          {
            題目: '克漏字 82',
            答案: 'D'
          },
          {
            題目: '克漏字 83',
            答案: 'C'
          },
          {
            題目: '克漏字 84',
            答案: 'B'
          },
          {
            題目: '克漏字 85',
            答案: 'C'
          },
          {
            題目: '克漏字 86',
            答案: 'A'
          },
          {
            題目: '克漏字 87',
            答案: 'D'
          },
          {
            題目: '克漏字 88',
            答案: 'A'
          },
          {
            題目: '克漏字 89',
            答案: 'C'
          },
          {
            題目: '克漏字 90',
            答案: 'D'
          },
          {
            題目: '克漏字 91',
            答案: 'B'
          },
          {
            題目: '克漏字 92',
            答案: 'B'
          },
          {
            題目: '克漏字 93',
            答案: 'D'
          },
          {
            題目: '克漏字 94',
            答案: 'A'
          },
          {
            題目: '克漏字 95',
            答案: 'D'
          },
          {
            題目: '克漏字 96',
            答案: 'C'
          },
          {
            題目: '克漏字 97',
            答案: 'A'
          },
          {
            題目: '克漏字 98',
            答案: 'C'
          },
          {
            題目: '克漏字 99',
            答案: 'A'
          },
          {
            題目: '克漏字 100',
            答案: 'B'
          }
        ],
        重組題: [
          {
            題目: '重組題 0',
            答案: 'D'
          },
          {
            題目: '重組題 1',
            答案: 'A'
          },
          {
            題目: '重組題 2',
            答案: 'C'
          },
          {
            題目: '重組題 3',
            答案: 'D'
          },
          {
            題目: '重組題 4',
            答案: 'C'
          },
          {
            題目: '重組題 5',
            答案: 'C'
          },
          {
            題目: '重組題 6',
            答案: 'B'
          },
          {
            題目: '重組題 7',
            答案: 'C'
          },
          {
            題目: '重組題 8',
            答案: 'C'
          },
          {
            題目: '重組題 9',
            答案: 'D'
          },
          {
            題目: '重組題 10',
            答案: 'B'
          },
          {
            題目: '重組題 11',
            答案: 'A'
          },
          {
            題目: '重組題 12',
            答案: 'C'
          },
          {
            題目: '重組題 13',
            答案: 'A'
          },
          {
            題目: '重組題 14',
            答案: 'D'
          },
          {
            題目: '重組題 15',
            答案: 'A'
          },
          {
            題目: '重組題 16',
            答案: 'B'
          },
          {
            題目: '重組題 17',
            答案: 'B'
          },
          {
            題目: '重組題 18',
            答案: 'B'
          },
          {
            題目: '重組題 19',
            答案: 'C'
          },
          {
            題目: '重組題 20',
            答案: 'D'
          },
          {
            題目: '重組題 21',
            答案: 'D'
          },
          {
            題目: '重組題 22',
            答案: 'D'
          },
          {
            題目: '重組題 23',
            答案: 'B'
          },
          {
            題目: '重組題 24',
            答案: 'A'
          },
          {
            題目: '重組題 25',
            答案: 'B'
          },
          {
            題目: '重組題 26',
            答案: 'B'
          },
          {
            題目: '重組題 27',
            答案: 'B'
          },
          {
            題目: '重組題 28',
            答案: 'D'
          },
          {
            題目: '重組題 29',
            答案: 'C'
          },
          {
            題目: '重組題 30',
            答案: 'A'
          },
          {
            題目: '重組題 31',
            答案: 'A'
          },
          {
            題目: '重組題 32',
            答案: 'A'
          },
          {
            題目: '重組題 33',
            答案: 'C'
          },
          {
            題目: '重組題 34',
            答案: 'B'
          },
          {
            題目: '重組題 35',
            答案: 'B'
          },
          {
            題目: '重組題 36',
            答案: 'C'
          },
          {
            題目: '重組題 37',
            答案: 'B'
          },
          {
            題目: '重組題 38',
            答案: 'B'
          },
          {
            題目: '重組題 39',
            答案: 'B'
          },
          {
            題目: '重組題 40',
            答案: 'B'
          },
          {
            題目: '重組題 41',
            答案: 'C'
          },
          {
            題目: '重組題 42',
            答案: 'A'
          },
          {
            題目: '重組題 43',
            答案: 'B'
          },
          {
            題目: '重組題 44',
            答案: 'B'
          },
          {
            題目: '重組題 45',
            答案: 'C'
          },
          {
            題目: '重組題 46',
            答案: 'C'
          },
          {
            題目: '重組題 47',
            答案: 'A'
          },
          {
            題目: '重組題 48',
            答案: 'A'
          },
          {
            題目: '重組題 49',
            答案: 'D'
          },
          {
            題目: '重組題 50',
            答案: 'C'
          },
          {
            題目: '重組題 51',
            答案: 'D'
          },
          {
            題目: '重組題 52',
            答案: 'C'
          },
          {
            題目: '重組題 53',
            答案: 'C'
          },
          {
            題目: '重組題 54',
            答案: 'A'
          },
          {
            題目: '重組題 55',
            答案: 'A'
          },
          {
            題目: '重組題 56',
            答案: 'B'
          },
          {
            題目: '重組題 57',
            答案: 'B'
          },
          {
            題目: '重組題 58',
            答案: 'D'
          },
          {
            題目: '重組題 59',
            答案: 'C'
          },
          {
            題目: '重組題 60',
            答案: 'A'
          },
          {
            題目: '重組題 61',
            答案: 'D'
          },
          {
            題目: '重組題 62',
            答案: 'A'
          },
          {
            題目: '重組題 63',
            答案: 'C'
          },
          {
            題目: '重組題 64',
            答案: 'C'
          },
          {
            題目: '重組題 65',
            答案: 'B'
          },
          {
            題目: '重組題 66',
            答案: 'B'
          },
          {
            題目: '重組題 67',
            答案: 'B'
          },
          {
            題目: '重組題 68',
            答案: 'C'
          },
          {
            題目: '重組題 69',
            答案: 'C'
          },
          {
            題目: '重組題 70',
            答案: 'C'
          },
          {
            題目: '重組題 71',
            答案: 'C'
          },
          {
            題目: '重組題 72',
            答案: 'D'
          },
          {
            題目: '重組題 73',
            答案: 'C'
          },
          {
            題目: '重組題 74',
            答案: 'C'
          },
          {
            題目: '重組題 75',
            答案: 'D'
          },
          {
            題目: '重組題 76',
            答案: 'B'
          },
          {
            題目: '重組題 77',
            答案: 'B'
          },
          {
            題目: '重組題 78',
            答案: 'A'
          },
          {
            題目: '重組題 79',
            答案: 'B'
          },
          {
            題目: '重組題 80',
            答案: 'A'
          },
          {
            題目: '重組題 81',
            答案: 'C'
          },
          {
            題目: '重組題 82',
            答案: 'C'
          },
          {
            題目: '重組題 83',
            答案: 'B'
          },
          {
            題目: '重組題 84',
            答案: 'B'
          },
          {
            題目: '重組題 85',
            答案: 'A'
          },
          {
            題目: '重組題 86',
            答案: 'C'
          },
          {
            題目: '重組題 87',
            答案: 'B'
          },
          {
            題目: '重組題 88',
            答案: 'A'
          },
          {
            題目: '重組題 89',
            答案: 'B'
          },
          {
            題目: '重組題 90',
            答案: 'A'
          },
          {
            題目: '重組題 91',
            答案: 'C'
          },
          {
            題目: '重組題 92',
            答案: 'C'
          },
          {
            題目: '重組題 93',
            答案: 'D'
          },
          {
            題目: '重組題 94',
            答案: 'B'
          },
          {
            題目: '重組題 95',
            答案: 'C'
          },
          {
            題目: '重組題 96',
            答案: 'C'
          },
          {
            題目: '重組題 97',
            答案: 'D'
          },
          {
            題目: '重組題 98',
            答案: 'D'
          },
          {
            題目: '重組題 99',
            答案: 'B'
          },
          {
            題目: '重組題 100',
            答案: 'D'
          }
        ],
        問答題: [
          {
            題目: '問答題 0',
            答案: 'D'
          },
          {
            題目: '問答題 1',
            答案: 'B'
          },
          {
            題目: '問答題 2',
            答案: 'B'
          },
          {
            題目: '問答題 3',
            答案: 'C'
          },
          {
            題目: '問答題 4',
            答案: 'B'
          },
          {
            題目: '問答題 5',
            答案: 'D'
          },
          {
            題目: '問答題 6',
            答案: 'A'
          },
          {
            題目: '問答題 7',
            答案: 'C'
          },
          {
            題目: '問答題 8',
            答案: 'B'
          },
          {
            題目: '問答題 9',
            答案: 'A'
          },
          {
            題目: '問答題 10',
            答案: 'D'
          },
          {
            題目: '問答題 11',
            答案: 'B'
          },
          {
            題目: '問答題 12',
            答案: 'A'
          },
          {
            題目: '問答題 13',
            答案: 'C'
          },
          {
            題目: '問答題 14',
            答案: 'D'
          },
          {
            題目: '問答題 15',
            答案: 'C'
          },
          {
            題目: '問答題 16',
            答案: 'A'
          },
          {
            題目: '問答題 17',
            答案: 'A'
          },
          {
            題目: '問答題 18',
            答案: 'C'
          },
          {
            題目: '問答題 19',
            答案: 'D'
          },
          {
            題目: '問答題 20',
            答案: 'A'
          },
          {
            題目: '問答題 21',
            答案: 'D'
          },
          {
            題目: '問答題 22',
            答案: 'A'
          },
          {
            題目: '問答題 23',
            答案: 'C'
          },
          {
            題目: '問答題 24',
            答案: 'D'
          },
          {
            題目: '問答題 25',
            答案: 'D'
          },
          {
            題目: '問答題 26',
            答案: 'A'
          },
          {
            題目: '問答題 27',
            答案: 'C'
          },
          {
            題目: '問答題 28',
            答案: 'D'
          },
          {
            題目: '問答題 29',
            答案: 'A'
          },
          {
            題目: '問答題 30',
            答案: 'C'
          },
          {
            題目: '問答題 31',
            答案: 'A'
          },
          {
            題目: '問答題 32',
            答案: 'A'
          },
          {
            題目: '問答題 33',
            答案: 'C'
          },
          {
            題目: '問答題 34',
            答案: 'A'
          },
          {
            題目: '問答題 35',
            答案: 'D'
          },
          {
            題目: '問答題 36',
            答案: 'A'
          },
          {
            題目: '問答題 37',
            答案: 'B'
          },
          {
            題目: '問答題 38',
            答案: 'B'
          },
          {
            題目: '問答題 39',
            答案: 'A'
          },
          {
            題目: '問答題 40',
            答案: 'D'
          },
          {
            題目: '問答題 41',
            答案: 'C'
          },
          {
            題目: '問答題 42',
            答案: 'C'
          },
          {
            題目: '問答題 43',
            答案: 'A'
          },
          {
            題目: '問答題 44',
            答案: 'A'
          },
          {
            題目: '問答題 45',
            答案: 'D'
          },
          {
            題目: '問答題 46',
            答案: 'D'
          },
          {
            題目: '問答題 47',
            答案: 'D'
          },
          {
            題目: '問答題 48',
            答案: 'C'
          },
          {
            題目: '問答題 49',
            答案: 'A'
          },
          {
            題目: '問答題 50',
            答案: 'B'
          },
          {
            題目: '問答題 51',
            答案: 'D'
          },
          {
            題目: '問答題 52',
            答案: 'A'
          },
          {
            題目: '問答題 53',
            答案: 'C'
          },
          {
            題目: '問答題 54',
            答案: 'D'
          },
          {
            題目: '問答題 55',
            答案: 'C'
          },
          {
            題目: '問答題 56',
            答案: 'C'
          },
          {
            題目: '問答題 57',
            答案: 'A'
          },
          {
            題目: '問答題 58',
            答案: 'C'
          },
          {
            題目: '問答題 59',
            答案: 'D'
          },
          {
            題目: '問答題 60',
            答案: 'A'
          },
          {
            題目: '問答題 61',
            答案: 'A'
          },
          {
            題目: '問答題 62',
            答案: 'C'
          },
          {
            題目: '問答題 63',
            答案: 'C'
          },
          {
            題目: '問答題 64',
            答案: 'C'
          },
          {
            題目: '問答題 65',
            答案: 'C'
          },
          {
            題目: '問答題 66',
            答案: 'D'
          },
          {
            題目: '問答題 67',
            答案: 'B'
          },
          {
            題目: '問答題 68',
            答案: 'C'
          },
          {
            題目: '問答題 69',
            答案: 'D'
          },
          {
            題目: '問答題 70',
            答案: 'A'
          },
          {
            題目: '問答題 71',
            答案: 'C'
          },
          {
            題目: '問答題 72',
            答案: 'B'
          },
          {
            題目: '問答題 73',
            答案: 'A'
          },
          {
            題目: '問答題 74',
            答案: 'D'
          },
          {
            題目: '問答題 75',
            答案: 'A'
          },
          {
            題目: '問答題 76',
            答案: 'D'
          },
          {
            題目: '問答題 77',
            答案: 'A'
          },
          {
            題目: '問答題 78',
            答案: 'D'
          },
          {
            題目: '問答題 79',
            答案: 'A'
          },
          {
            題目: '問答題 80',
            答案: 'A'
          },
          {
            題目: '問答題 81',
            答案: 'A'
          },
          {
            題目: '問答題 82',
            答案: 'D'
          },
          {
            題目: '問答題 83',
            答案: 'A'
          },
          {
            題目: '問答題 84',
            答案: 'A'
          },
          {
            題目: '問答題 85',
            答案: 'C'
          },
          {
            題目: '問答題 86',
            答案: 'B'
          },
          {
            題目: '問答題 87',
            答案: 'C'
          },
          {
            題目: '問答題 88',
            答案: 'A'
          },
          {
            題目: '問答題 89',
            答案: 'B'
          },
          {
            題目: '問答題 90',
            答案: 'D'
          },
          {
            題目: '問答題 91',
            答案: 'D'
          },
          {
            題目: '問答題 92',
            答案: 'C'
          },
          {
            題目: '問答題 93',
            答案: 'C'
          },
          {
            題目: '問答題 94',
            答案: 'B'
          },
          {
            題目: '問答題 95',
            答案: 'C'
          },
          {
            題目: '問答題 96',
            答案: 'D'
          },
          {
            題目: '問答題 97',
            答案: 'A'
          },
          {
            題目: '問答題 98',
            答案: 'B'
          },
          {
            題目: '問答題 99',
            答案: 'A'
          },
          {
            題目: '問答題 100',
            答案: 'D'
          }
        ]
      }
    }
  },

  methods: {
  },

  mounted () {
    //* 計算答案各占比
    const answerCount = {
      A: 0,
      B: 0,
      C: 0,
      D: 0
    }
    //* 自動生成題庫類型:是非題、單選題、複選題、克漏字、重組題、問答題
    const data = []
    function random (type, num) {  // eslint-disable-line
      for (let i = 0; i < num; i++) {
        const obj = {
          題目: `${type} ${i}`,
          答案: getRandomAns()
        }
        data.push(obj)
      }
      console.log(data)
      console.log(answerCount) //* 查看答案各占比
    }
    // * random('問答題', 100) //? 自動產生 100 筆 假資料

    //* 隨機產生答案 A-D
    function getRandomAns () {
      const answerList = ['A', 'B', 'C', 'D']
      const answer = answerList[Math.floor(Math.random() * answerList.length)]
      answerCount[answer]++

      return answer
    }
  }

}
</script>

<style lang='scss' scope></style>
