<template>
  <!-- 產生幾組考卷 -->
  <h2 class="h5">設定要自動產生多少份考卷</h2>
  我要產生 <input type="number" v-model="examPaperNum" style="width:45px"> 組考卷
  <button type="button" @click="getExamPaper">產生題目</button>

  <br>
  <br>

  <!-- 選單:選擇使用的考卷 -->
  <select @change="changePreviewExPaper" v-if="Object.keys(teacherUseExPaper).length===0 && Object.keys(previewQueList).length>0">
    <option :value="keys" v-for="(val,keys) in previewQueList" :key="`perview${keys}`">
      {{ keys }}
    </option>
  </select>

  <button type="button" class="mx-5 my-4" @click="teacherUseExPaper=perviewExamPaper" v-if="Object.keys(teacherUseExPaper).length===0&& Object.keys(previewQueList).length>0">確定使用此考卷</button>
  <button type="button" class="mx-5 my-4" @click="clearExPaper" v-if="Object.keys(teacherUseExPaper).length>0">重選考卷</button>

  <br>

  <!-- 考卷選擇:渲染題組、題目選項 -->
  <ul class="mb-2" v-if="Object.keys(teacherUseExPaper).length===0">
    <li v-for="(val, keys) in perviewExamPaper" :key="keys">
      <p class="mb-0">
        {{ keys }} <small>(每題 {{ questionsList[keys].score }} 分, 共 {{ val.length }}題)</small>
      </p>
      <ul>
        <li v-for="(val) in val" :key="val">
          題目:{{ val.題目 }}, <span class="bg-hightLight">答案：{{ getAnsPosition(val.選項) }}</span>, {{ val.選項 }}
        </li>
      </ul>
    </li>
  </ul>

  <!-- 渲染已選擇的考卷題目 -->
  <button type="button" @click="randomSort" v-if="Object.keys(teacherUseExPaper).length>0">隨機排序答案選項</button>
  <ul class="mb-2" v-if="Object.keys(teacherUseExPaper).length>0">
    <li v-for="(val, keys) in teacherUseExPaper" :key="keys">
      <p class="mb-0">
        {{ keys }} <small>(每題 {{ questionsList[keys].score }} 分, 共 {{ val.length }}題)</small>
        <span class="bg-hightLight ms-5">答案各佔比：{{ ansPercentage(val) }}</span>
      </p>
      <ul>
        <li v-for="(val) in val" :key="val">
          題目:{{ val.題目 }}, <span class="bg-hightLight">答案：{{ getAnsPosition(val.選項) }}</span>, {{ val.選項 }}
        </li>
      </ul>
    </li>
  </ul>
</template>

<script>
import { mapState } from 'vuex'
export default {

  computed: {
    ...mapState(['questionsList'])
  },

  data () {
    return {
      questions: {
        是非題: [
          {
            題目: '是非題 1',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 2',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 3',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 4',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '是非題 5',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 6',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 7',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '是非題 8',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 9',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 10',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 11',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 12',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 13',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 14',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 15',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 16',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 17',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 18',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 19',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 20',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 21',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 22',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '是非題 23',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 24',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '是非題 25',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 26',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 27',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 28',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '是非題 29',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '是非題 30',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 31',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 32',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 33',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '是非題 34',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 35',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 36',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 37',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 38',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '是非題 39',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 40',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '是非題 41',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 42',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 43',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 44',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 45',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 46',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 47',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 48',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 49',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 50',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 51',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 52',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 53',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 54',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 55',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 56',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 57',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 58',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '是非題 59',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 60',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '是非題 61',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 62',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 63',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '是非題 64',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 65',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 66',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 67',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 68',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 69',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '是非題 70',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 71',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 72',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 73',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 74',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 75',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 76',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 77',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 78',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 79',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 80',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 81',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 82',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 83',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 84',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 85',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 86',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 87',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 88',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 89',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '是非題 90',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 91',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 92',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '是非題 93',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '是非題 94',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 95',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 96',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '是非題 97',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '是非題 98',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '是非題 99',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '是非題 100',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          }
        ],
        單選題: [
          {
            題目: '單選題 1',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 2',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 3',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 4',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 5',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 6',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 7',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 8',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 9',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 10',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 11',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 12',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 13',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 14',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 15',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 16',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 17',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 18',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 19',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 20',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 21',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 22',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 23',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 24',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 25',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 26',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 27',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 28',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 29',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 30',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 31',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 32',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 33',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 34',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 35',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 36',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 37',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 38',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 39',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 40',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 41',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 42',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 43',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 44',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 45',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 46',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 47',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 48',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 49',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 50',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 51',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 52',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 53',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 54',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 55',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 56',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 57',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 58',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 59',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 60',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 61',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 62',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 63',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 64',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 65',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 66',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 67',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 68',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 69',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 70',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 71',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 72',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 73',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 74',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 75',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 76',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 77',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 78',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 79',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 80',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 81',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 82',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 83',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 84',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 85',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 86',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 87',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 88',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 89',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 90',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 91',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 92',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 93',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 94',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 95',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '單選題 96',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 97',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '單選題 98',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '單選題 99',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '單選題 100',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          }
        ],
        複選題: [
          {
            題目: '複選題 1',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 2',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '複選題 3',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 4',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '複選題 5',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '複選題 6',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 7',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 8',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 9',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 10',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 11',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 12',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 13',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 14',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 15',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 16',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 17',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 18',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 19',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 20',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 21',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 22',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '複選題 23',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 24',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 25',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 26',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 27',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 28',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 29',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 30',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 31',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 32',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 33',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 34',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 35',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 36',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 37',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 38',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '複選題 39',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 40',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '複選題 41',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 42',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '複選題 43',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 44',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 45',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '複選題 46',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 47',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '複選題 48',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 49',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 50',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 51',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 52',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '複選題 53',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 54',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 55',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '複選題 56',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 57',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 58',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '複選題 59',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 60',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 61',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 62',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 63',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 64',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 65',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 66',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 67',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 68',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 69',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 70',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 71',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 72',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 73',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 74',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 75',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 76',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 77',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 78',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '複選題 79',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '複選題 80',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 81',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 82',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 83',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 84',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 85',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '複選題 86',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 87',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 88',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 89',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 90',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '複選題 91',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 92',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '複選題 93',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '複選題 94',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 95',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 96',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 97',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 98',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '複選題 99',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '複選題 100',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          }
        ],
        克漏字: [
          {
            題目: '克漏字 1',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 2',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 3',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '克漏字 4',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 5',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 6',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 7',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 8',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 9',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 10',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 11',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '克漏字 12',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 13',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 14',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 15',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 16',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 17',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '克漏字 18',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '克漏字 19',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 20',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 21',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '克漏字 22',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 23',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 24',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '克漏字 25',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 26',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 27',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 28',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 29',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 30',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 31',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 32',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 33',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 34',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 35',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 36',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '克漏字 37',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 38',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '克漏字 39',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 40',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '克漏字 41',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 42',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 43',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 44',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 45',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 46',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 47',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 48',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 49',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '克漏字 50',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 51',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 52',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 53',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 54',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 55',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 56',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 57',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 58',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 59',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 60',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 61',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '克漏字 62',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 63',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 64',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 65',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '克漏字 66',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '克漏字 67',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 68',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '克漏字 69',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 70',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 71',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 72',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '克漏字 73',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 74',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 75',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '克漏字 76',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '克漏字 77',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 78',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '克漏字 79',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 80',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 81',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 82',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '克漏字 83',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 84',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 85',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 86',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 87',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 88',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 89',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 90',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 91',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 92',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 93',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 94',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '克漏字 95',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 96',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 97',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 98',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '克漏字 99',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '克漏字 100',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          }
        ],
        重組題: [
          {
            題目: '重組題 1',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 2',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '重組題 3',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 4',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 5',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 6',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 7',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 8',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '重組題 9',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 10',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '重組題 11',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 12',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 13',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 14',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 15',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 16',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 17',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 18',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 19',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 20',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 21',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 22',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 23',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 24',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 25',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 26',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '重組題 27',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 28',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 29',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 30',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '重組題 31',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 32',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 33',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 34',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 35',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 36',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '重組題 37',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 38',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 39',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 40',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 41',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 42',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 43',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 44',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 45',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 46',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 47',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 48',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 49',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 50',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 51',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '重組題 52',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 53',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 54',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '重組題 55',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 56',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 57',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 58',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 59',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '重組題 60',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 61',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '重組題 62',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 63',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 64',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 65',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 66',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '重組題 67',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 68',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 69',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '重組題 70',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 71',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 72',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 73',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 74',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 75',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 76',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 77',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 78',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 79',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 80',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 81',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 82',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '重組題 83',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 84',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 85',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 86',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 87',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '重組題 88',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 89',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 90',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 91',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '重組題 92',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 93',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '重組題 94',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '重組題 95',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 96',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '重組題 97',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 98',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '重組題 99',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '重組題 100',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          }
        ],
        問答題: [
          {
            題目: '問答題 1',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 2',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 3',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 4',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 5',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 6',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 7',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 8',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 9',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 10',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 11',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 12',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 13',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 14',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 15',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 16',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 17',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 18',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 19',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 20',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 21',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 22',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 23',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 24',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 25',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 26',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 27',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 28',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 29',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 30',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 31',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 32',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 33',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 34',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 35',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 36',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 37',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 38',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 39',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 40',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 41',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 42',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 43',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 44',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 45',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 46',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 47',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 48',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 49',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 50',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 51',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 52',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 53',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 54',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 55',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 56',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 57',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 58',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 59',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 60',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 61',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 62',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 63',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 64',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 65',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 66',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 67',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 68',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 69',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 70',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 71',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 72',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 73',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 74',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 75',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 76',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 77',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 78',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 79',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 80',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 81',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 82',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 83',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 84',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 85',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 86',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 87',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 88',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 89',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 90',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 91',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 92',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 93',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          },
          {
            題目: '問答題 94',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 95',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 96',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 97',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'A'
          },
          {
            題目: '問答題 98',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'C'
          },
          {
            題目: '問答題 99',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'D'
          },
          {
            題目: '問答題 100',
            選項: {
              A: '選項 1',
              B: '選項 2',
              C: '選項 3',
              D: '答案'
            },
            答案: 'B'
          }
        ]
      },
      previewQueList: {}, //* 給用戶選要哪一組考卷
      perviewExamPaper: {},
      examPaperNum: 1,
      teacherUseExPaper: {} //* 老師選擇的考卷

    }
  },

  methods: {
    //* 切換預覽考卷
    changePreviewExPaper (e) {
      const currentExPaper = e.target.value
      this.perviewExamPaper = this.previewQueList[currentExPaper]
    },
    //* 新增*組考卷
    getExamPaper () {
      //* 若產生考卷數量大於 0
      const exPaperNum = this.examPaperNum
      if (exPaperNum > 0) {
        this.previewQueList = {} //* 初始化
        for (let i = 0; i < exPaperNum; i++) {
          this.previewQueList[`考卷${i + 1}`] = this.getRandomQuestions()
        }
        this.perviewExamPaper = this.previewQueList['考卷1'] //* 預設顯示考卷1
      }
    },
    //* 重選考卷
    clearExPaper () {
      //* 初始化
      this.teacherUseExPaper = {}
      this.previewQueList = {}
      this.perviewExamPaper = {}
    },
    //* 生成用戶選擇的各題組 指定數量的隨機題目
    getRandomQuestions () {
      const obj = {}
      Object.keys(this.questionsList).forEach((queKeys) => {
        //* 若題目數量大於 0
        if (this.questionsList[queKeys].queNum) {
          const queNum = this.questionsList[queKeys].queNum
          const shuffled = this.questions[queKeys].slice(0)
          let i = this.questions[queKeys].length
          const min = i - queNum
          let temp
          let index
          while (i-- > min) {
            index = Math.floor((i + 1) * Math.random())
            temp = shuffled[index]
            shuffled[index] = shuffled[i]
            shuffled[i] = temp
          }
          obj[queKeys] = shuffled.slice(min)
        }
      })
      return obj
    },
    //* 亂數排序答案選項
    randomSort () {
      let newArr = []
      Object.keys(this.teacherUseExPaper).forEach(keys => {
        this.teacherUseExPaper[keys].forEach(item => {
          const arr = []
          Object.keys(item.選項).forEach(keys => {
            arr.push(item.選項[keys])
            newArr = sort(arr)
          })

          item.選項 = {
            A: newArr[0],
            B: newArr[1],
            C: newArr[2],
            D: newArr[3]
          }
        })
      })
      //* 將答案順序打亂
      function sort (arr) {
        for (let i = 0, l = arr.length; i < l; i++) {
          const rc = parseInt(Math.random() * l)
          // 让当前循环的数组元素和随机出来的数组元素交换位置
          const empty = arr[i]
          arr[i] = arr[rc]
          arr[rc] = empty
        }
        return arr
      }
    },
    //* 取得答案選項位置
    getAnsPosition (ansObj) {
      const ansOptions = ['A', 'B', 'C', 'D']
      const position = Object.keys(ansObj).findIndex(keys => {
        return ansObj[keys] === '答案'
      })
      return ansOptions[position]
    },
    //* 答案各佔比
    ansPercentage (ans) {
      const answerCount = {
        A: 0,
        B: 0,
        C: 0,
        D: 0
      }
      ans.forEach(item => {
        const ansIndex = Object.keys(item.選項).findIndex(optionABCD => {
          return item.選項[optionABCD] === '答案'
        })
        if (ansIndex === 0) {
          answerCount.A++
        } else if (ansIndex === 1) {
          answerCount.B++
        } else if (ansIndex === 2) {
          answerCount.C++
        } else if (ansIndex === 3) {
          answerCount.D++
        }
      })
      return `A：${answerCount.A}, B：${answerCount.B}, C： ${answerCount.C}, D：${answerCount.D}`
    }
  },

  mounted () {
    //* 計算答案各佔比
    const answerCount = {
      A: 0,
      B: 0,
      C: 0,
      D: 0
    }
    //* 自動生成題庫類型:是非題、單選題、複選題、克漏字、重組題、問答題
    const data = []
    function random (type, num) {
      for (let i = 0; i < num; i++) {
        const obj = {
          題目: `${type} ${i + 1}`,
          選項: {
            A: '選項 1',
            B: '選項 2',
            C: '選項 3',
            D: '答案'
          },
          答案: getRandomAns()
        }
        data.push(obj)
      }
      // console.log(data)
      // console.log(answerCount) //* 查看答案各占比
    }
    random('問答題', 100) // ? 自動產生 100 筆 假資料

    //* 隨機產生答案 A-D
    function getRandomAns () {
      const answerList = ['A', 'B', 'C', 'D']
      const answer = answerList[Math.floor(Math.random() * answerList.length)]
      answerCount[answer]++

      return answer
    }
  }

}
</script>

<style lang='scss' scope>
.bg-hightLight{
  background: rgba(189, 253, 255, 0.665);
}
</style>
